name: "LeNet"
layer {
  name: "data"
  type: "Input"
  top: "data"
  input_param { shape: { dim: 1 dim: 3 dim: 480 dim: 640 } }
}
layer{
  name: "text_proposal"
  type: "TextProposal"
  bottom: "data"
  top: "proposals"
  text_proposal_param{
      proposal_method: "Canny"
      num_proposals: 1000
  }


}